Glance

* Main
** TODO [#C] optparse-applicative
* REPL [1/2]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-15 Sat 15:14]
:END:

** DONE Some commands (like pragmas) should apply on eol
CLOSED: [2023-09-10 Sun 23:26]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-09-10 Sun 23:26]
:END:

** TODO Pretty print
* Data
** TODO Tags: change List to Set
* Parser [16/23]
:LOGBOOK:
- State "STARTED"    from "TODO"       [2023-08-05 Sat 10:08]
:END:

** TODO Parse comments (from # to eol)
** TODO Parse links
** TODO Parse tables
** TODO Parse commented/archived headlines (type: ordinary/commented/archived)
** TODO Parse encrypted headlines (meta: encrypted regions)
** TODO Parse closed headlines

** DONE OrgLine parsing
CLOSED: [2023-07-15 Sat 17:10]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2023-07-15 Sat 17:10]
- State "STARTED"    from "TODO"       [2023-07-15 Sat 15:54]
CLOCK: [2023-07-15 Sat 15:54]--[2023-07-15 Sat 17:10] =>  1:16
:END:
** DONE [#A] Implement stateful todo-state parsing
CLOSED: [2023-07-21 Fri 09:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-21 Fri 09:45]
:END:
** DONE Parse pragmas that change contexts
CLOSED: [2023-07-21 Fri 22:52]
:LOGBOOK:
- State "DONE"       from "PENDING"    [2023-07-21 Fri 22:52]
- State "PENDING"    from "TODO"       [2023-07-21 Fri 22:05]
:END:
** DONE Parse category
CLOSED: [2023-07-21 Fri 22:52]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-21 Fri 22:52]
:END:
** DONE Parse properties
CLOSED: [2023-07-22 Sat 18:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-22 Sat 18:49]
:END:
** DONE Parse todo (simple)
CLOSED: [2023-07-22 Sat 18:49]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-22 Sat 18:49]
:END:
** DONE Extend todo pragma parser
CLOSED: [2023-07-23 Sun 11:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-23 Sun 11:14]
:END:
** DONE Explicit headline metadata
CLOSED: [2023-07-25 Tue 08:46]
:LOGBOOK:
- State "DONE"       from "PENDING"    [2023-07-25 Tue 08:46]
- State "PENDING"    from "STARTED"    [2023-07-24 Mon 09:11]
- State "STARTED"    from "TODO"       [2023-07-24 Mon 09:08]
CLOCK: [2023-07-24 Mon 09:08]--[2023-07-24 Mon 09:11] =>  0:03
:END:
** DONE Parse timestamps
CLOSED: [2023-08-01 Tue 11:07]
:LOGBOOK:
- State "DONE"       from "PENDING"    [2023-08-01 Tue 11:07]
- State "PENDING"    from "STARTED"    [2023-07-25 Tue 10:06]
- State "STARTED"    from "TODO"       [2023-07-25 Tue 10:06]
:END:
** DONE Timestamp list → meta
CLOSED: [2023-08-01 Tue 11:08]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-08-01 Tue 11:08]
:END:
** DONE [#A] Recursive parsing of elements and context derivation
CLOSED: [2023-08-09 Wed 08:50]
:LOGBOOK:
- State "DONE"       from "PENDING"    [2023-08-09 Wed 08:50]
- State "PENDING"    from "STARTED"    [2023-08-06 Sun 10:05]
- State "STARTED"    from "TODO"       [2023-08-05 Sat 21:44]
CLOCK: [2023-08-05 Sat 21:44]--[2023-08-06 Sun 10:05] => 12:21
:END:
** DONE Refactor gADTs to the simple type classes
CLOSED: [2023-08-15 Tue 14:16]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2023-08-15 Tue 14:16]
- State "STARTED"    from "TODO"       [2023-08-13 Sun 10:35]
:END:
** DONE Multiline property block parser
CLOSED: [2023-08-31 Thu 10:12]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2023-08-31 Thu 10:12]
- State "STARTED"    from "TODO"       [2023-08-30 Wed 17:11]
:END:
** DONE Fix multiline parsing
CLOSED: [2023-09-04 Mon 23:54]
:LOGBOOK:
- State "DONE"       from "STARTED"    [2023-09-04 Mon 23:54]
- State "STARTED"    from "TODO"       [2023-09-04 Mon 23:29]
CLOCK: [2023-09-04 Mon 23:29]--[2023-09-04 Mon 23:54] =>  0:25
:END:
#+begin_quote
 * TODO Hello there\n:PROPERTIES:\n:CATEGORY: Hello\n:END:
#+end_quote
** DONE [#C] Align corrupted tag parser with org-mode parser
CLOSED: [2023-08-01 Tue 11:09]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-08-01 Tue 11:09]
:END:
** DONE [#C] Optimize headline parser
CLOSED: [2023-08-01 Tue 11:09]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-08-01 Tue 11:09]
:END:
* Persistent [1/3]
** DONE Understand ID/UUIDs
CLOSED: [2023-07-25 Tue 09:16]
:LOGBOOK:
- State "DONE"       from "TODO"       [2023-07-25 Tue 09:16]
:END:

title + tags + timestamps
** TODO Simple crud
** TODO Kuzu
* Relations [0/2]
** TODO Inherit properties only from parents (implement headline stack, vertical inheritance)
** TODO @-relations
* Integrations [0/2]
** TODO Emacs
** TODO Browser
* TODO Design & scenarios (org-glance)
** TODO Init: store directory structure
- Root directory
  - Resources
    - {headline_created_date}-{headline_id}
      - ...
  - Headlines
    - {headline_created_date}-{headline_id}.org
  - Views
    - {view_id}+{view_state}.org
  - Metastore
** TODO Store: CRUD
** TODO View: CRUD
** TODO View: get headlines from the specific view
** TODO Move headline to the different view / views
** TODO Headline: CRUD
** TODO Import / Export headlines
** TODO Overview
